//
//  ViewController.swift
//  1_14 homework
//
//  Created by Павел Замулин on 26.02.2022.
//
/*
 Задание:
 a) два текстовых поля для имени и фамилии, которые сохраняют введённые данные в UserDefaults, а при повторном запуске приложения показывают последние введённые строки (выполнено);
 b) Список Todo с возможностью добавления и удаления задач, в котором задачи кешируются в Realm, а при повторном запуске показываются последние сохранённые задачи (выполнено).
 c) То же самое, только с использованием CoreData (выполнено).
 d) Перенесите экран с показом погоды из предыдущего домашнего задания в этот проект. Сделайте кеширование для текущей погоды и прогноза после загрузки с сервера, чтобы после перезапуска показывались последние сохранённые данные (пока идёт повторное обновление) (не было предыдущего домашнего задания с погодой. Вместо него был Рик и Морти).
 e) Создайте аккаунт на http://bitbucket.org/ и http://github.com, в каждом из сервисов создайте публичный репозиторий под этот проект, выгрузите его в них и пришлите ссылки на репозитории.
 */

import UIKit

class ViewController: UIViewController {

    override func viewDidLoad() {
        super.viewDidLoad()
    }


}

